dany994/vak-opensource/trunk/microcontrollers/pic32proxy/adapter-mpsse.c
    if (debug_level > 1)
        fprintf (stderr, "%s: xfer instruction %08x\n", a->adapter.name, instruction);

    /* Select Control Register. */
    mpsse_send (a, 1, 1, 5, ETAP_CONTROL, 0);

    /* Wait until CPU is ready.
     * Check if Processor Access bit (bit 18) is set. */
    do {
        mpsse_send (a, 0, 0, 32, CONTROL_PRACC |
                                 CONTROL_PROBEN |
                                 CONTROL_PROBTRAP |
                                 CONTROL_EJTAGBRK, 1);
        ctl = mpsse_recv (a);
    } while (! (ctl & CONTROL_PRACC));

    /* Select Data Register.
     * Send the instruction. */
    mpsse_send (a, 1, 1, 5, ETAP_DATA, 0);
    mpsse_send (a, 0, 0, 32, instruction, 0);

    /* Tell CPU to execute instruction. */
    mpsse_send (a, 1, 1, 5, ETAP_CONTROL, 0);
    mpsse_send (a, 0, 0, 32, CONTROL_PROBEN |
                             CONTROL_PROBTRAP, 0);
}

/*
 * Read a word from memory (without PE).
 */
static unsigned mpsse_read_word (adapter_t *adapter, unsigned addr)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;

    serial_execution (a);

    //fprintf (stderr, "%s: read word from %08x\n", a->adapter.name, addr);
    xfer_instruction (a, 0x3c04bf80);           // lui s3, 0xFF20
    xfer_instruction (a, 0x3c080000 | addr_hi); // lui t0, addr_hi
    xfer_instruction (a, 0x35080000 | addr_lo); // ori t0, addr_lo
    xfer_instruction (a, 0x8d090000);           // lw t1, 0(t0)
    xfer_instruction (a, 0xae690000);           // sw t1, 0(s3)

    mpsse_send (a, 1, 1, 5, ETAP_FASTDATA, 0);
    mpsse_send (a, 0, 0, 33, 0, 1);
    unsigned word = mpsse_recv (a) >> 1;

    if (debug_level > 0)
        fprintf (stderr, "%s: read word at %08x -> %08x\n", a->adapter.name, addr, word);
    return word;
}

/*
 * Read a memory block.
 */
static void mpsse_read_data (adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    //mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    //fprintf (stderr, "%s: read %d bytes from %08x\n", a->adapter.name, nwords*4, addr);
    for (; nwords > 0; nwords--) {
        *data++ = mpsse_read_word (adapter, addr);
        addr += 4;
    }
}
#endif

static void pracc_exec_read (mpsse_adapter_t *a, unsigned address)
{
    int offset;
    unsigned data;

    if ((address >= MIPS32_PRACC_PARAM_IN) &&
        (address <= MIPS32_PRACC_PARAM_IN + a->num_iparam * 4))
    {
        offset = (address - MIPS32_PRACC_PARAM_IN) / 4;
        data = a->local_iparam [offset];

    } else if ((address >= MIPS32_PRACC_PARAM_OUT) &&
               (address <= MIPS32_PRACC_PARAM_OUT + a->num_oparam * 4))
    {
        offset = (address - MIPS32_PRACC_PARAM_OUT) / 4;
        data = a->local_oparam [offset];

    } else if ((address >= MIPS32_PRACC_TEXT) &&
               (address <= MIPS32_PRACC_TEXT + a->code_len * 4))
    {
        offset = (address - MIPS32_PRACC_TEXT) / 4;
        data = a->code [offset];

    } else if (address == MIPS32_PRACC_STACK)
    {
        /* save to our debug stack */
        offset = --a->stack_offset;
        data = a->stack [offset];
    } else
    {
        fprintf (stderr, "%s: error reading unexpected address %08x\n",
            a->adapter.name, address);
        exit (-1);
    }

    /* Send the data out */
    mpsse_send (a, 1, 1, 5, ETAP_DATA, 0);
    mpsse_send (a, 0, 0, 32, data, 0);

    /* Clear the access pending bit (let the processor eat!) */
    mpsse_send (a, 1, 1, 5, ETAP_CONTROL, 0);
    mpsse_send (a, 0, 0, 32, 0, 0);
    mpsse_flush_output (a);
}

static void pracc_exec_write (mpsse_adapter_t *a, unsigned address)
{
    unsigned data;
    int offset;

    /* Get data */
    mpsse_send (a, 1, 1, 5, ETAP_DATA, 0);
    mpsse_send (a, 0, 0, 32, 0, 1);
    data = mpsse_recv (a);

    /* Clear access pending bit */
    mpsse_send (a, 1, 1, 5, ETAP_CONTROL, 0);
    mpsse_send (a, 0, 0, 32, 0, 0);
    mpsse_flush_output (a);

    if ((address >= MIPS32_PRACC_PARAM_IN) &&
        (address <= MIPS32_PRACC_PARAM_IN + a->num_iparam * 4))
    {
        offset = (address - MIPS32_PRACC_PARAM_IN) / 4;
        a->local_iparam [offset] = data;

    } else if ((address >= MIPS32_PRACC_PARAM_OUT) &&
               (address <= MIPS32_PRACC_PARAM_OUT + a->num_oparam * 4))
    {
        offset = (address - MIPS32_PRACC_PARAM_OUT) / 4;
        a->local_oparam [offset] = data;

    } else if (address == MIPS32_PRACC_STACK)
    {
        /* save data onto our stack */
        a->stack [a->stack_offset++] = data;
    } else
    {
        fprintf (stderr, "%s: error writing unexpected address %08x\n",
            a->adapter.name, address);
        exit (-1);
    }
}

static void mpsse_exec (adapter_t *adapter, int code_len,
    const unsigned *code, int num_param_in, uint32_t *param_in,
    int num_param_out, uint32_t *param_out, int cycle)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned ctl, address;
    int pass = 0;

    a->local_iparam = param_in;
    a->local_oparam = param_out;
    a->num_iparam = num_param_in;
    a->num_oparam = num_param_out;
    a->code = code;
    a->code_len = code_len;
    a->stack_offset = 0;

    for (;;) {
        /* Select Control register. */
        mpsse_send (a, 1, 1, 5, ETAP_CONTROL, 0);

	/* Wait for the PrAcc to become "1". */
        do {
            mpsse_send (a, 0, 0, 32, 0, 1);
            ctl = mpsse_recv (a);
        } while (! (ctl & CONTROL_PRACC));

        /* Read Address register. */
        mpsse_send (a, 1, 1, 5, ETAP_ADDRESS, 0);
        mpsse_send (a, 0, 0, 32, 0, 1);
        address = mpsse_recv (a);

        /* Check for read or write */
        if (ctl & CONTROL_PRNW) {
            pracc_exec_write (a, address);
        } else {
            /* Check to see if its reading at the debug vector. The first pass through
             * the module is always read at the vector, so the first one we allow.  When
             * the second read from the vector occurs we are done and just exit. */
            if ((address == MIPS32_PRACC_TEXT) && (pass++)) {
                break;
            }
            pracc_exec_read (a, address);
        }

        if (cycle == 0)
            break;
    }

    /* Stack sanity check */
    if (a->stack_offset != 0) {
        fprintf (stderr, "%s: exec stack not zero = %d\n",
            a->adapter.name, a->stack_offset);
        exit (-1);
    }
}

