dany994/vak-opensource/trunk/microcontrollers/pic32proxy/adapter-mpsse.c
/*
 * Initialize adapter F2232.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 */
adapter_t *adapter_open_mpsse (void)
{
    mpsse_adapter_t *a;
    struct usb_bus *bus;
    struct usb_device *dev;
    char *name;

    usb_init();
    usb_find_busses();
    usb_find_devices();
    for (bus = usb_get_busses(); bus; bus = bus->next) {
        for (dev = bus->devices; dev; dev = dev->next) {
            if (dev->descriptor.idVendor == OLIMEX_VID &&
                (dev->descriptor.idProduct == OLIMEX_ARM_USB_TINY ||
                 dev->descriptor.idProduct == OLIMEX_ARM_USB_TINY_H))
                name = "Olimex ARM-USB-Tiny";
                goto found;
        }
    }
    /*fprintf (stderr, "USB adapter not found: vid=%04x, pid=%04x\n",
        OLIMEX_VID, OLIMEX_PID);*/
    return 0;
found:
    a = calloc (1, sizeof (*a));
    if (! a) {
        fprintf (stderr, "%s: out of memory\n", name);
        return 0;
    }
    a->adapter.name = name;
    a->usbdev = usb_open (dev);
    if (! a->usbdev) {
        fprintf (stderr, "%s: usb_open() failed\n", a->adapter.name);
        free (a);
        return 0;
    }
    usb_claim_interface (a->usbdev, 0);
    printf ("Adapter: %s, id %04x:%04x\n", a->adapter.name,
        dev->descriptor.idVendor, dev->descriptor.idProduct);

    /* Reset the ftdi device. */
    if (usb_control_msg (a->usbdev,
        USB_TYPE_VENDOR | USB_RECIP_DEVICE | USB_ENDPOINT_OUT,
        SIO_RESET, 0, 1, 0, 0, 1000) != 0) {
        if (errno == EPERM)
            fprintf (stderr, "%s: superuser privileges needed.\n", a->adapter.name);
        else
            fprintf (stderr, "%s: FTDI reset failed\n", a->adapter.name);
failed: usb_release_interface (a->usbdev, 0);
        usb_close (a->usbdev);
        free (a);
        return 0;
    }

    /* MPSSE mode. */
    if (usb_control_msg (a->usbdev,
        USB_TYPE_VENDOR | USB_RECIP_DEVICE | USB_ENDPOINT_OUT,
        SIO_SET_BITMODE, 0x20b, 1, 0, 0, 1000) != 0) {
        fprintf (stderr, "%s: can't set sync mpsse mode\n", a->adapter.name);
        goto failed;
    }

    /* Optimal rate is 0.5 MHz.
     * Divide base oscillator 6 MHz by 12. */
    unsigned divisor = 12 - 1;
    unsigned char latency_timer = 2;

    if (usb_control_msg (a->usbdev,
        USB_TYPE_VENDOR | USB_RECIP_DEVICE | USB_ENDPOINT_OUT,
        SIO_SET_LATENCY_TIMER, latency_timer, 1, 0, 0, 1000) != 0) {
        fprintf (stderr, "%s: unable to set latency timer\n", a->adapter.name);
        goto failed;
    }
    if (usb_control_msg (a->usbdev,
        USB_TYPE_VENDOR | USB_RECIP_DEVICE | USB_ENDPOINT_IN,
        SIO_GET_LATENCY_TIMER, 0, 1, (char*) &latency_timer, 1, 1000) != 1) {
        fprintf (stderr, "%s: unable to get latency timer\n", a->adapter.name);
        goto failed;
    }
    if (debug_level) {
    	fprintf (stderr, "%s: divisor: %u\n", a->adapter.name, divisor);
    	fprintf (stderr, "%s: latency timer: %u usec\n", a->adapter.name, latency_timer);
    }

    /* Light a LED. */
    mpsse_reset (a, 0, 0, 1);

    if (debug_level) {
     int baud = 6000000 / (divisor + 1);
        fprintf (stderr, "%s: speed %d samples/sec\n", a->adapter.name, baud);
    }
    mpsse_speed (a, divisor);

    /* Disable TDI to TDO loopback. */
    unsigned char enable_loopback[] = "\x85";
    bulk_write (a, enable_loopback, 1);

    /* Reset the JTAG TAP controller. */
    mpsse_send (a, 6, 31, 0, 0, 0);             /* TMS 1-1-1-1-1-0 */

    /* Check status. */
    mpsse_send (a, 1, 1, 5, TAP_SW_MTAP, 0);
    mpsse_send (a, 1, 1, 5, MTAP_COMMAND, 0);
    mpsse_send (a, 0, 0, 8, MCHP_STATUS, 1);
    unsigned status = mpsse_recv (a);
    if (debug_level > 0)
        fprintf (stderr, "%s: status %04x\n", a->adapter.name, status);
    if (status & MCHP_STATUS_DEVRST)
        fprintf (stderr, "%s: processor is in reset mode\n", a->adapter.name);
    if ((status & ~MCHP_STATUS_DEVRST) !=
        (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY | MCHP_STATUS_FAEN))
    {
        fprintf (stderr, "%s: invalid status = %04x\n", a->adapter.name, status);
        free (a);
        return 0;
    }

    /* User functions. */
    a->adapter.close = mpsse_close;
    a->adapter.get_idcode = mpsse_get_idcode;
    a->adapter.cpu_stopped = mpsse_cpu_stopped;
    a->adapter.stop_cpu = mpsse_stop_cpu;
    a->adapter.reset_cpu = mpsse_reset_cpu;
    a->adapter.run_cpu = mpsse_run_cpu;
    a->adapter.step_cpu = mpsse_step_cpu;
    a->adapter.exec = mpsse_exec;
    //a->adapter.read_word = mpsse_read_word;
    //a->adapter.read_data = mpsse_read_data;
    return &a->adapter;
}
